# написать генератор нечётных чисел от 1 до n (включительно),
# используя ключевое слово yield


n = 15
def odd_num(num):
    for num in range(1, num + 1, 2):
        yield num


for n in odd_num(15):
    print(n)


#     --------------------------------------------- 2 ---------------------------------------------------
# решить задачу генерации нечётных чисел, не используя ключевое слово yield

n = int(input('Введите число: '))
print(*[num for num in range(1, n + 1, 2)])
# print(*(num for num in range(1, n + 1, 2)))


